docs/posts/2015-07-07-guns-cakes-and-gay-weddings.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 20, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Guns, Cakes, and Gay Weddings</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/neat.css' type='text/css'/>
<link rel='stylesheet' href='/css/custom.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Guns, Cakes, and Gay Weddings</h1>
<p class="subtitle" role="doc-subtitle">Jul 07, 2015</p>
</header><p>
Internet memes rarely constitute a high level of discourse, but they can sometimes prompt interesting conversations. This morning, a friend posted one that read,
</p>

<blockquote>
<p>
If selling a gay couple a wedding cake means a &ldquo;christian&rdquo; baker participated in their marriage, does selling a gun to a murderer mean a &ldquo;christian&rdquo; gun store owner participated in the murder?
</p>
</blockquote>

<p>
The gun store owner does indeed participate in the murder, though not in a way that makes him<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> morally responsible for the murder. He is even more of a participant in the murder than the baker is a participant in the marriage, because the actions of the gun store owner, however unwitting, are causally significant in a way that the actions of the baker are not. All other things being equal, without the gun, there would have been no murder. All other things being equal, without the cake, the couple would still be married.
</p>

<p>
The important question with respect to the gun store owner is what kind of participation is required for moral culpability. Although negligence complicates things, let&rsquo;s assume that one is morally responsible for what one knowingly participates in. Since the gun dealer is not aware, (nor negligently unware — that is, there&rsquo;s no sign posted saying &ldquo;If you plan to commit a murder with this firearm, please do not tell me&#x2026;&rdquo;) then the store owner is not morally responsible.
</p>

<p>
From what some service providers have said, though, it&rsquo;s not participation <i>per se</i> that is the problem, it&rsquo;s that their participation could be viewed as tacit approval. I don&rsquo;t understand why that&rsquo;s the case — we wouldn&rsquo;t take a Bar Mitzvah cake baked by a Christian baker to imply approval of Judaism, an <i>Eid-al-Fitr</i> cake to be an approval of Islam, or a Super Bowl cake to imply approval of professional sports.
</p>

<p>
Maybe the gun case is not close enough to be a good analogy. Maybe we should instead ask if the Christian restaurant owner is a culpable participant in my act of gluttony by selling me overly large portions with the full expectation that I will eat it all on the spot.
</p>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
: I usually mix masculine and feminine pronouns to avoid sexist language, but in this case, I think it&rsquo;s reasonable to assume that most gun store owners are male.
</p></div></div>


</div>
</div></main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 20, 2024. Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
